performance_result_100.txt
========================================
성능 측정 결과: 게시글 100개
측정 일시: #오후
========================================

[Redis 방식]
  평균 응답 시간: 163.743ms
  처리량: 610.71 req/s
  실패 요청: 0건

[DB 방식]
  평균 응답 시간: 252.175ms
  처리량: 396.55 req/s
  실패 요청: 0건

[개선 효과]
  응답 속도: 252.175ms → 163.743ms (35.1% 개선)
  처리량: 1.5배 증가

========================================
상세 결과
========================================

[Redis 상세]
This is ApacheBench, Version 2.3 <$Revision: 1913912 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient).....done


Server Software:        
Server Hostname:        localhost
Server Port:            8080

Document Path:          /api/posts/ranking?topN=10
Document Length:        982 bytes

Concurrency Level:      100
Time taken for tests:   1.637 seconds
Complete requests:      1000
Failed requests:        0
Total transferred:      1257000 bytes
HTML transferred:       982000 bytes
Requests per second:    610.71 [#/sec] (mean)
Time per request:       163.743 [ms] (mean)
Time per request:       1.637 [ms] (mean, across all concurrent requests)
Transfer rate:          749.67 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.5      0       2
Processing:     9  153  77.6    148     511
Waiting:        8  153  77.6    148     511
Total:          9  153  77.6    149     511

Percentage of the requests served within a certain time (ms)
  50%    149
  66%    178
  75%    202
  80%    217
  90%    254
  95%    294
  98%    334
  99%    362
 100%    511 (longest request)

[DB 상세]
This is ApacheBench, Version 2.3 <$Revision: 1913912 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient).....done


Server Software:        
Server Hostname:        localhost
Server Port:            8080

Document Path:          /api/posts/ranking/db?topN=10
Document Length:        964 bytes

Concurrency Level:      100
Time taken for tests:   2.522 seconds
Complete requests:      1000
Failed requests:        0
Total transferred:      1239000 bytes
HTML transferred:       964000 bytes
Requests per second:    396.55 [#/sec] (mean)
Time per request:       252.175 [ms] (mean)
Time per request:       2.522 [ms] (mean, across all concurrent requests)
Transfer rate:          479.81 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.4      0       2
Processing:    12  243 143.2    214     881
Waiting:       12  242 143.1    214     881
Total:         12  243 143.2    214     881

Percentage of the requests served within a certain time (ms)
  50%    214
  66%    281
  75%    318
  80%    351
  90%    440
  95%    511
  98%    619
  99%    688
 100%    881 (longest request)